fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСписокНаСервере (Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &КонецПериода
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &НачалоПериода
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
		
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокДоговоров = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокДокументов = Новый Структура;
		СписокДокументов.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор);
		//СписокДокументов.Вставить("Реализация", ВыборкаДетальныеЗаписи.Реализация);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			ДокументРеализация = ВыборкаДетальныеЗаписи.Реализация.ПолучитьОбъект();
		Иначе
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		КонецЕсли;
		
		ДокументРеализация.Дата = Период.ДатаОкончания;
		ДокументРеализация.Заполнить(ВыборкаДетальныеЗаписи.Договор);
		ДокументРеализация.ВКМ_ВыполнитьАвтозаполнение();
		
		Если ДокументРеализация.ПроверитьЗаполнение() Тогда
			
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			//СписокДокументов.Вставить("РеализацияТоваровУслуг", ДокументРеализация.Ссылка);
			СписокДокументов.Вставить("Реализация", ДокументРеализация.Ссылка);
			
		КонецЕсли;
		
		СписокДоговоров.Добавить(СписокДокументов);
		
	КонецЦикла;
	
	
	Возврат СписокДоговоров;
	
	
КонецФункции

#КонецОбласти

#КонецЕсли
